In [83]:
import pandas as pd

In [87]:
data = [{'account': 'Jones LLC', 'Jan': 150, 'Feb': 200, 'Mar': 140},
         {'account': 'Alpha Co',  'Jan': 200, 'Feb': 210, 'Mar': 215},
         {'account': 'Blue Inc',  'Jan': 50,  'Feb': 90,  'Mar': 95 }]

In [88]:
df = pd.DataFrame(data)
# df.columns = ['Rekening','januari','februari','maart']

mapping = {'account':'Rekening', 'Jan':'januari', 'Feb':'februari', 'Mar':'maart'}

In [90]:
df.columns = df.columns.map(mapping)

In [91]:
df

    Rekening  januari  februari  maart
0  Jones LLC      150       200    140
1   Alpha Co      200       210    215
2   Blue Inc       50        90     95

## DataFrame

In [15]:
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [50]:
df.dtypes

account    object
Jan         int64
Feb         int64
Mar         int64
dtype: object

In [52]:
df.shape

(3, 4)

In [53]:
df.describe()

              Jan         Feb         Mar
count    3.000000    3.000000    3.000000
mean   133.333333  166.666667  150.000000
std     76.376262   66.583281   60.621778
min     50.000000   90.000000   95.000000
25%    100.000000  145.000000  117.500000
50%    150.000000  200.000000  140.000000
75%    175.000000  205.000000  177.500000
max    200.000000  210.000000  215.000000

## Serie

In [41]:
s = df['Jan']
s

0    150
1    200
2     50
Name: Naam, dtype: int64

In [42]:
s.dtype

dtype('int64')

In [43]:
s.name

'Naam'

In [48]:
s

0    150.0
1    200.0
2     50.0
Name: Naam, dtype: float64

In [49]:
s.astype('float64', copy=True)

0    150.0
1    200.0
2     50.0
Name: Naam, dtype: float64

## Indecing

In [60]:
df[['account','Jan','Feb']]

     account  Jan  Feb
0  Jones LLC  150  200
1   Alpha Co  200  210
2   Blue Inc   50   90

In [64]:
df['Jan']<100

0    False
1    False
2     True
Name: Naam, dtype: bool

In [65]:
df[df['Jan']<100]

    account  Jan  Feb  Mar
2  Blue Inc   50   90   95

## New column

In [66]:
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [69]:
df['Totaal'] = df['Jan'] +  df['Feb'] +  df['Mar']

In [70]:
df

     account  Jan  Feb  Mar  Maal2  Totaal
0  Jones LLC  150  200  140    300     490
1   Alpha Co  200  210  215    400     625
2   Blue Inc   50   90   95    100     235